/* $Header: drivers.c,v 1.29.1.4.1.1.1.2 90/10/05 10:02:30 beacker Exp $ */
/* |-----------------------------------------------------------|
 * | Copyright (c) 1990 MIPS Computer Systems, Inc.            |
 * | All Rights Reserved                                       |
 * |-----------------------------------------------------------|
 * |          Restricted Rights Legend                         |
 * | Use, duplication, or disclosure by the Government is      |
 * | subject to restrictions as set forth in                   |
 * | subparagraph (c)(1)(ii) of the Rights in Technical        |
 * | Data and Computer Software Clause of DFARS 52.227-7013.   |
 * |         MIPS Computer Systems, Inc.                       |
 * |         950 DeGuigne Drive                                |
 * |         Sunnyvale, CA 94086                               |
 * |-----------------------------------------------------------|
 */

/*	Copyright (c) 1984 AT&T	*/
/*	  All Rights Reserved  	*/

#include <sys/types.h>
#include <sys/param.h>
#include "lboot.h"
#include <a.out.h> /* includes #include <filehdr.h> #include <syms.h> */
#include <ldfcn.h>
#include <sys/sysmacros.h>
#include "boothdr.h"

#include "error.h"

#ifndef MIPSEBMAGIC_2
#define MIPSEBMAGIC_2		0x163
#endif
#define MIPSEBMAGIC_2_OLD	0x150

#ifdef u3b2
#include <sys/sbd.h>

/*
 * Default system devices from VTOC
 */
extern char	*VTOC_devname;		/* driver name associated with boot device */
extern int	VTOC_major;		/* board slot of boot device (major number) */
extern int 	VTOC_minor;		/* device number on controller */
extern int	VTOC_root;		/* partition number */
extern int	VTOC_swap;		/* partition number */
extern int	VTOC_nswap;		/* partition size */
#endif

/*
 * Compute external major number for a device on a supported LBE (the LBE must
 * be at local bus address 14 or 15)
 */
#define	LBEMAJ(lba,elb)	((((lba)-13)<<4) | (elb))

/*
 * Given a major number for a device on a LBE, compute the local bus address 
 * (lba) of its LBE and the extended local bus address (elb) of the device
 */
#define	LBELBA(m)	(13+((m)>>4))
#define	LBEELB(m)	((m)&0x0F)


/*
 * Global variables used during the dynamic loading process
 */

struct kernel *kernel;			/* head of object file linked list */
struct driver *driver;			/* head of struct driver linked list */

int	edt_count;	/* total number of EDT entries */
int	number_drivers; /* total number of drivers to be loaded */


struct rtname {
	char *name;
	char *routine;
} rtname[] = {
	/* functions defined in the UNIX kernel */
	/* these must be in one-to-one correspondence with RNULL,RNOSYS,... */
	/* [RNOTHING]*/	{ "",		"{ }"	},
	/* [RNULL] */	{ "nulldev",	"{ nulldev();}"	},
	/* [RNOSYS] */	{ "nosys",	"{ nosys();}"	},
	/* [RNODEV] */	{ "nodev",	"{ nodev();}"	},
	/* [RTRUE] */	{ "true",	"{ return(1);}"	},
	/* [RFALSE] */	{ "false",	"{ return(0);}"	},
	/* [RFSNULL]*/	{ "fsnull",	"{ return(fsnull());}"	},
	/* [RFSSTRAY]*/	{ "fsstray",	"{ return(fsstray());}"	},
	/* [RNOPKG]*/	{ "nopkg",	"{ nopkg();}"	},
	/* [RNOREACH]*/	{ "noreach",	"{ noreach();}"	},
	/* [RZERO]*/	{ "0",		"{ }"	},
			{  0,		0	}
};

char *Nzero = "0";
char *Nnofile = "nofile";

/*
 * private copies of variables that will be generated for UNIX
 */
int 		fstypcnt;
int             cdevcnt;
int             bdevcnt;
int		fmodcnt;
int 		fsincnt;
short		nfstyp;

dev_t           rootdev = NODEV;
dev_t           pipedev = NODEV;
dev_t           dumpdev = NODEV;
dev_t           swapdev = NODEV;
daddr_t         swplo = -1;
int             nswap = -1;


/*
 * structures used to generate io subsystem code
 */
struct Bdevsw {
	char *d_open;
	char *d_close;
	char *d_strategy;
	char *d_print;
	char *d_dump;
	char *d_size;
};
struct Cdevsw {
	char *d_open;
	char *d_close;
	char *d_read;
	char *d_write;
	char *d_ioctl;
	char *d_ttys;
	char *d_str;
	char *d_mmap;
	char *d_select;
};
struct Fmodsw {
	char *f_name;
	char *f_strmtab;
};

/*file system switch structure */
struct Fstypsw {
/* 0*/	char *fs_init;
/* 1*/	char *fs_iput;
/* 2*/	char *fs_iread;
/* 3*/	char *fs_filler;
/* 4*/	char *fs_iupdat;
/* 5*/	char *fs_readi;
/* 6*/	char *fs_writei;
/* 7*/	char *fs_itrunc;
/* 8*/	char *fs_statf;
/* 9*/	char *fs_namei;
/*10*/	char *fs_mount;
/*11*/	char *fs_umount;
/*12*/	char *fs_getinode;
/*13*/	char *fs_openi;
/*14*/	char *fs_closei;
/*15*/	char *fs_update;
/*16*/	char *fs_statfs;
/*17*/	char *fs_access;
/*18*/	char *fs_getdents;
/*19*/	char *fs_allocmap;
/*20*/	char *fs_freemap;
/*21*/	char *fs_readmap;
/*22*/	char *fs_setattr;
/*23*/	char *fs_notify;
/*24*/	char *fs_fcntl;
/*25*/	char *fs_fsinfo;
/*26*/	char *fs_ioctl;
/*27*/	char *fs_dirlookup;
/*28*/	char *fs_direnter;
/*29*/	char *fs_dirremove;
/*30*/	char *fs_dirinit;
/*31*/	char *fs_dirisempty;
/*32*/	char *fs_bmap;
/*33*/	char *fs_ialloc;
/*34*/	char *fs_idestroy;
/*35*/	char *fs_ifree;
/*36*/	char *fs_setsize;
/*37*/	char *fs_rmount;
/*38*/	char *fs_rumount;
/*39*/  char *fs_fsync;
};

/* FS specific data */
struct Fsinfo {
	char *fs_flags;		/* long fs_flags; */
	char *fs_pipe;		/* struct mount	*fs_pipe; */
	char *fs_name;		/* char *fs_name; */
	char *fs_notfy;		/* long fs_notfy; */
};

struct Bdevsw *bdevswp;
struct Cdevsw *cdevswp;
int Major[256];
struct Fmodsw *fmodswp;
struct Fstypsw *fstypswp;
struct Fsinfo *fsinfop;
char **io_init;
char **next_init;
char **io_pwrclr;
char **next_pwrclr;


/*
 * Static function declarations for this file
 */
static void             build_io_subsys();
static void             dependency();
static struct driver	*finddriver();
static void             print_configuration();


/*
 * finddriver()
 *
 * Search the master directory for master file "name".
 */
 static struct driver *
finddriver(name)
char *name;
{
	register struct master *mp;
	struct driver *dp;
	register i;
	int fd = -1;
	struct stat statbuf;
	FILHDR fhdr;
	SCNHDR shdr;
	ushort filetype;

	dp = NULL;
	mp = NULL;

